Tekla Open API Reference for Tekla Structures 2025
ViewLabelMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.ViewLabelMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DrawingName
Returns the drawing name property element type.
Scale
Returns the scale property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
ViewName
Returns the view name property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.ViewLabelMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace